app/controllers/employees_controller.rb

	def index
		@employee = Employee.all
---
SELECT "employees".* FROM "employees"

	def create
		#render plain:params[:employee].inspect
		@employee = Employee.new(employee_params)
		@employee.save
---
INSERT INTO "employees" ("name", "age", "designation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Pradeepa"], ["age", 26], ["designation", "SD"], ["created_at", "2018-12-15 10:53:47.290092"], ["updated_at", "2018-12-15 10:53:47.290092"]]

	def update
		@employee = Employee.find(params[:id])
		@employee.update(employee_params)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "employees" SET "designation" = ?, "gender" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["designation", "SD1"], ["gender", "female"], ["updated_at", "2018-12-16 06:25:22.785057"], ["id", 3]]